'''
описание программы. Дальше я не буду это писать, но добавить надо везде.
'''

# тут и далее я не буду писать каждый раз про непонятность названий переменных, но она есть
M = [5, 4, 3, 2, 1, 10, 420, 30, 0]
i = 0

while i < 9:  # что такое 9. надо что-то типа len(M)
    j = i
    p = i

    while j < 9: 
        if M[j] < M[p]:
            p = j

        j += 1

    if M[p] < M[i]:  # есть функция swap
        a = M[i]
        M[i] = M[p]
        M[p] = a

    i += 1

print(M)

# оценка 0/10 т.к. задание не выполнено - Напишите функцию, которая...
# с функцией было бы 5/10
